app/controllers/admins/registrations_controller.rb

SELECT COUNT(*) FROM "admins"
---
  def check_admin_limit
    if Admin.count >= Admin::MAX_ADMINS