app/controllers/pages_controller.rb

SELECT "users".* FROM "users"
---
  def admin
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def ban_user
    user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def unban_user
    user = User.find(params[:id])