app/views/admins/shared/_links.html.erb


<%- if devise_mapping.registerable? && controller_name != 'registrations' && Admin.count < Admin::MAX_ADMINS %>
---
SELECT COUNT(*) FROM "admins"