app/models/admin.rb

  def forbid_extra_admin_creation
    if Admin.count >= MAX_ADMINS
---
SELECT COUNT(*) FROM "admins"